---
kind: type
id: T:Autodesk.Revit.DB.Structure.RebarPresentationMode
source: html/84cfa6b2-460d-9d32-1f6a-55dbbfece098.htm
---
# Autodesk.Revit.DB.Structure.RebarPresentationMode

Bar presentation mode

## Syntax (C#)
```csharp
public enum RebarPresentationMode
```